app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)
    @team.manager_id = 1
    if @team.save
---
INSERT INTO "teams" ("name", "sport", "min_players", "min_females", "manager_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "drg"], ["sport", "dfgb"], ["min_players", 4], ["min_females", 4], ["manager_id", 1], ["created_at", "2016-06-27 22:48:22.166357"], ["updated_at", "2016-06-27 22:48:22.166357"]]