app/controllers/users_controller.rb

INSERT INTO "users" ("name", "phone_number", "email", "salt", "crypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.create(user_params)